#include<iostream>
#include<cmath>
using namespace std;
int main ()
{
    //setlocale(LC_ALL, ".Ukrainian");
    float x1, y1, x2, y2, x3, y3; //координати вершин А, B та C
    float a, b, c; //сторони трикутника - проміжні дані
    float P, s; //периметр та площа трикутника
    float p; //півпериметр - проміжні дані
    cout << "Введіть координати вершини А: ";
    cin >> x1 >> y1;//ввести координати вершини А
    cout << "Введіть координати вершини В: ";
    cin >> x2 >> y2;//ввести координати вершини В
    cout << "Введіть координати вершини C: ";
    cin >> x3 >> y3;//ввести координати вершини С
    a = sqrt(pow(x1 - x2, 2) + pow(y1 - y2, 2));//знаходемо сторону а за допомогою формули довжини вектора
    b = sqrt(pow(x2 - x3, 2) + pow(y2 - y3, 2));//знаходемо сторону b за допомогою формули довжини вектора
    c = sqrt(pow(x1 - x3, 2) + pow(y1 - y3, 2));//знаходемо сторону c за допомогою формули довжини вектора
    P = a + b + c;//знаходемо периметр трикутника
    p = P/2;//знаходемо півпериметр - проміжні дані
    s = sqrt(p * (p - a) * (p - b) * (p - c));//знаходемо площу трикутника за допомогою формули Герона
    cout << "P= " << P << endl;//виводемо периметр
    cout << "s= " << s << endl;//виводемо площу
    
}
